Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: =item getc FILEHANDLE X<getc> X<getchar> X<character> X<file, read>
es_es: =item getc IDENTIFICADOR_ARCHIVO X<getc> X<getchar> X<character> X<file, read> X<archivo, lectura> X<carácter>

source: Otherwise it returns false (specifically, the empty string).
es_es: De lo contrario, devuelve falso (en concreto, la cadena vacía).

source: Semicolon omitted in "short" one-line BLOCK.
es_es: Punto y coma omitido en BLOQUE "pequeño" de una sola línea.

source: Perl's operator overloading facility is completely ignored here.
es_es: Se omite completamente la funcionalidad de sobrecarga de operadores de Perl,

source: =head2 Perl variable types
es_es: =head2 Tipos de variables de Perl

source: print @AoA; # WRONG
es_es: print @AoA; # MAL

source: =head2 Constant subroutines
es_es: =head2 Subrutinas constantes

source: perldelta Perl changes since previous version
es_es: perldelta Cambios desde la versión anterior

source: It is often more readable to use the C<< => >> operator between key/value pairs.
es_es: A menudo es más legible usar el operador C<< => >> entre los pares clave / valor.

source: I<Always> close the handle yourself and inspect the return value.
es_es: I<Siempre> cierre el C<handle> e inspeccione el valor devuelto.

source: =head2 Range Operators X<operator, range> X<range> X<..> X<...>
es_es: =head2 Operadores de rango X<operator, range> X<range> X<..> X<...> X<operador, rango> X<rango>

# print "2: got $1 " if $y =~ /^(ABC)(?!123)/;
source: print "2: got $1\n" if $y =~ /^(ABC)(?!123)/;
es_es: print "2: tenemos $1\n" if $y =~ /^(ABC)(?!123)/;

source: # blank line between header and body
es_es: # línea en blanco entre cabecera y cuerpo

source: Deleting from a C<tied> hash or array may not necessarily return anything; it depends on the implementation of the C<tied> package's DELETE method, which may do whatever it pleases.
es_es: Borrando de un hash o array C<enlazado> no necesariamente devolverá algo; depende de la implementación del método DELETE en el paquete C<enlazado>, que puede hacer lo que quiera.

source: To get somewhat similar but locale-dependent date strings, set up your locale environment variables appropriately (please see L<perllocale>) and try for example:
es_es: Para obtener algo similar, pero con cadenas de fecha dependiente de la configuración región, ajuste apropiadamente sus variables de entorno a la región (por favor, vea L<perllocale>) e intente, por ejemplo:

# printf " got sentence %d: <%s> ", ++$count, $1;
source: printf "\tgot sentence %d: <%s>\n", ++$count, $1;
es_es: printf "\tnueva sentencia %d: <%s>\n", ++$cuenta, $1;

source: $pattern = "foobar";
es_es: $patron = "foobar";

source: my $z = substr $s, -4, 2; # tr
es_es: my $z = substr $s, -5, 2; # ve

source: For more information, including instructions for other platforms such as Windows and Mac OS, read L<perlrun>.
es_es: Para obtener más información e instrucciones para otras plataformas, como Windows y Mac OS, lea L<perlrun>.

source: If no string is specified via the C<=~> or C<!~> operator, the $_ string is searched.
es_es: Si no se especifica una cadena vía los operadores C<=~> o C<!~>, se busca en la cadena $_.

source: # either write TO_KID or else read FROM_KID
es_es: # o escribo AL_HIJO o leo DESDE_EL_HIJO

source: @counts = ( scalar @a, scalar @b, scalar @c );
es_es: @contadores = ( scalar @a, scalar @b, scalar @c );

source: refers to such a Package if it has not been modified, or has been modified in accordance with the wishes of the Copyright Holder as specified below.
es_es: se refiere a un paquete, si no ha sido modificado o ha sido modificado de conformidad con los deseos del propietario del Titular del Copyright tal como se especifica a continuación.

source: Recommended reading is "The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)" by Joel Spolsky, at L<http://joelonsoftware.com/articles/Unicode.html>.
es_es: Para adquirir estos conocimientos básicos, es recomendable leer el artículo "The Absolute Minimum Every Software Developer Absolutely, Positively Must Know About Unicode and Character Sets (No Excuses!)" de Joel Spolsky, en L<http://joelonsoftware.com/articles/Unicode.html>.

source: $~ = 'Something';
es_es: $~ = 'Algo';

source: For example, a 4-byte integer 0x12345678 (305419896 decimal) would be ordered natively (arranged in and handled by the CPU registers) into bytes as
es_es: Por ejemplo, un entero de 4 bytes 0x12345678 (305419896 en decimal) se ordenaría nativamente (dispuesto en y manejado por los registros de la CPU) en bytes como

source: ($a, $b, @rest) = split;
es_es: ($a, $b, @resto) = split;

# $header =~ s/ (?=s)//g; # fix continuation lines
source: $header =~ s/\n(?=\s)//g; # fix continuation lines
es_es: $encabezado =~ s/\n(?=\s)//g; # arregla la continuación de líneas

source: sub prompt { print "yes?
es_es: sub prompt { print "¿si?

source: :-) Larry now uses "Perl" to signify the language proper and "perl" the implementation of it, i.e. the current interpreter.
es_es: :-) Larry usa "Perl" para designar el lenguaje y "perl" para designar su implementación (es decir, el intérprete).

source: In addition to these changes, lots of work took place in integrating threads, PerlIO, and Unicode; general code cleanup; and last but not least porting to non-Unix lands such as Win32, VMS, Cygwin, DJGPP, VOS, MacOS Classic, and EBCDIC.
es_es: Además de estos cambios, mucho trabajo se llevó a cabo en la integración de I<threads>, PerlIO, y Unicode; limpieza general del código, y por último, pero no menos importante, portar a los no-Unix, tales como Win32, VMS, Cygwin, DJGPP, VOS, Mac OS Classic, y EBCDIC.

source: compactDump => 1, # comment these two lines out
es_es: compactDump => 1, # comentar estas dos líneas

source: Don't bother.
es_es: No es necesario.

source: =head2 Build system
es_es: =head2 Sistema de compilación

source: If C<$_> is lexical in the scope where the C<map> appears (because it has been declared with C<my $_>), then, in addition to being locally aliased to the list elements, C<$_> keeps being lexical inside the block; that is, it can't be seen from the outside, avoiding any potential side-effects.
es_es: Si C<$_> es léxico en el ámbito cuando el C<map> aparece (porque se ha declarado con C<my $_>), entonces, además de ser un alias local a los elementos de la lista, C<$_> sigue siendo léxico dentro del bloque, es decir, no puede ser visto desde el exterior, evitando cualquier potencial efecto secundario.

source: In the current implementation, no temporary array is created when the range operator is used as the expression in C<foreach> loops, but older versions of Perl might burn a lot of memory when you write something like this:
es_es: En la implementación actual, no se crea ningún array temporal cuando el operador rango es usado como expresión en los bucles C<foreach>, pero versiones anteriores de Perl pueden quemar una gran cantidad de memoria cuando se escribe algo como esto:

source: $days # the simple scalar value "days"
es_es: $dias # el valor escalar único llamado "dias"

source: See L<perlmod> for details on this.
es_es: Ver L<perlmod> para detalles sobre esto.

source: Checks whether the pattern matches (or does not match, for the '!' variants).
es_es: Comprueba si el patrón coincide (o no coincide, con las variantes '!').

source: The higher-level loops preserve an additional state between iterations: whether the last match was zero-length.
es_es: Los bucles de alto nivel preservan un estado adicional entre las iteraciones: cuándo la última coincidencia fue de longitud cero.

source: Due to the current arguably broken state of C<__DIE__> hooks, you may wish not to trigger any C<__DIE__> hooks that user code may have installed.
es_es: Debido al posible mal estado de la llamada C<__DIE__>, quizás deseé no activar ninguna de las llamadas C<__DIE__> que el código de usuario puede haber instalado.

source: CPAN has several JAPH programs at http://www.cpan.org/misc/japh .
es_es: En CPAN encontrará varios programas JAPH, en http://www.cpan.org/misc/japh.

source: The defaults are there for lazy systems programmers writing one-shot programs.
es_es: Los valores por defecto son para los programadores de sistemas perezosos escribiendo programas pequeños.

source: The inheritance hierarchy of the C<B::> modules has been corrected; C<B::NV> now inherits from C<B::SV> (instead of C<B::IV>).
es_es: La jerarquía de la herencia de los módulos C<B::> ha sido corregida; C<B::NV> ahora hereda desde C<B::SV> (en lugar de C<B::IV>).

source: Most importantly, choose modules which are as stable as possible.
es_es: Lo más importante es elegir los módulos que sean lo más estables posible.

source: b) the "Artistic License" which comes with this Kit.
es_es: b) la "Licencia Artística" que viene con este equipo.

source: If a socket gets closed by the server while printing to it, the client now gets a SIGPIPE.
es_es: Si un I<socket> es cerrado por el servidor mientras se está imprimiendo en él, el cliente recibe ahora una SIGPIPE.

source: (.*)\b(\d+)$ <I have 2 numbers: > <53147>
es_es: (.*)\b(\d+)$ <Tengo 2 números: > <53147>

source: Because a C<bless> is often the last thing in a constructor, it returns the reference for convenience.
es_es: Como un C<bless> a menudo es la última cosa de un constructor, devuelve la referencia por conveniencia.

source: It is distributed in releases and comes in well-defined packages.
es_es: Se distribuye en versiones y se proporciona en paquetes bien definidos.

source: A class implementing a hash should have the following methods:
es_es: Una clase que implementa un hash debe tener los siguientes métodos:

source: The I<length-item> is not returned explicitly from C<unpack>.
es_es: La I<longitud-item> no se devuelve de forma explícita desde C<unpack>.

source: Well, that's because the rule is that on adjacent brackets only (whether square or curly), you are free to omit the pointer dereferencing arrow.
es_es: Bueno, eso es porque la regla dice que sólo en los corchetes o llaves adyacentes, es libre de omitir la flecha de referencias.

source: =item L<pod2man|pod2man> and L<pod2text|pod2text>
es_es: =item L<pod2man|pod2man> y L<pod2text|pod2text>

source: Appeal to their self interest!
es_es: Hágales ver que es por su propio interés.

source: Whatever happens in the RE engine might be better discussed in L<perlre>, but for the sake of continuity, we shall do so here.
es_es: Pase lo que pase en el motor de RE podría estar mejor explicado en L<perlre>, pero en aras de la continuidad, lo haremos aquí.

source: You can always switch mode mid-format with an explicit C<C0> or C<U0> in the format.
es_es: Siempre puede cambiar de modo con un explícito C<C0> o C<U0> en mitad del formato.

source: has meant since Perl 5.6.0
es_es: ha significado desde Perl 5.6.0

source: Using C<eof()> with empty parentheses is different.
es_es: Usar C<eof()> con paréntesis vacíos es diferente.

source: Otherwise if FILEHANDLE is an expression, its value is the real filehandle.
es_es: De lo contrario, si IDENTIFICADOR_ARCHIVO es una expresión, su valor es el identificador de archivo real.

source: You may want to call L<seek|/"seek FILEHANDLE,POSITION,WHENCE"> before writing to the file.
es_es: Puede llamar a L<seek|/"seek IDENTIFICADOR_ARCHIVO,POSICIÓN,DESDE"> antes de escribir al archivo.

source: Provide links to further information (URL, email)
es_es: Ofrezca enlaces a información adicional (URL, correo electrónico)

source: The value is passed direct as the parameter I<kflags> to C<hv_common()>.
es_es: El valor es pasado directamente como el parámetro I<kflags> a C<hv_common()>.

source: Here is yet another way to print your environment:
es_es: Aquí hay otra forma de imprimir su entorno:

source: Each plugin should register itself with C<Perl_mro_register> by providing the following structure
es_es: Cada complemento debe registrarse con C<Perl_mro_register> proporcionando la siguiente estructura

# $_ = 'pq'; print $x," "; # prints 5pq9
source: $_ = 'pq'; print $x,"\n"; # prints 5pq9
es_es: $_ = 'pq'; print $x,"\n"; # imprime 5pq9

source: perl591delta - what is new for perl v5.9.1
es_es: perl591delta - qué hay de nuevo en perl v5.9.1

source: It means "use the standard size for a Perl integer or floating-point number", which is the default.
es_es: Esto significa "usar el tamaño estándar de un entero Perl o punto de número de coma flotante", que es el predeterminado.

source: -z File has zero size (is empty).
es_es: -z Archivo tiene tamaño cero (está vacío).

source: You can dispense with numbers altogether and create named capture groups.
es_es: Puede prescindir de los números y crear grupos de captura con nombres.

source: And the tables used by hashes (sometimes called "associative arrays") grow as necessary to prevent degraded performance.
es_es: Y las tablas usadas por los hashes (a veces denominados "arrays asociativos") se expanden cuando es necesario para que el rendimiento no se vea afectado.

source: The C<use sigtrap> and even C<use diagnostics> pragmas may also prove useful.
es_es: El pragma C<use sigtrap> e incluso el C<use diagnostics> pueden ser también muy útiles.

source: There is an incompatibility in OpenBSD's C<getprotobyname_r> and C<getservbyname_r> function in versions 3.7 and later that will cause a SEGV when called without doing a C<bzero> on their return structs prior to calling these functions.
es_es: Existe una incompatibilidad en las funciones de OpenBSD C<getprotobyname_r> y C<getservbyname_r> en las versiones 3.7 y superiores que causarán un SEGV cuando se llamen sin haber hecho antes un C<bzero> en sus estructuras de retorno antes de llamar a estas funciones.

source: The name of the C<(*SKIP:NAME)> pattern has special significance.
es_es: El nombre del patrón C<(*SKIP:NOMBRE)> tiene un significado especial.

source: =head2 When shouldn't I program in Perl?
es_es: =head2 ¿Cuándo no debo elegir Perl?

source: C<atan2(0, i)> now works, as do all the (computable) complex argument cases
es_es: C<atan2(0, i)> ahora funciona, así como todos los casos (computables) de argumentos complejos

source: That means, for example, that C<-f($file).".bak"> is equivalent to C<-f "$file.bak">.
es_es: Esto significa, por ejemplo, que C<-f($archivo).".bak"> es equivalente a C<-f "$file.bak">.

source: A bugfix related to the handling of the C</m> modifier and C<qr> resulted in a change of behaviour between 5.8.x and 5.10.0:
es_es: Una corrección de errores relacionados con el manejo del modificador C</m> y C<qr> resultó en un cambio de comportamiento entre 5.8.x y 5.10.0:

source: General Perl style guide
es_es: Guía de estilo general programación Perl

source: perlcheat Perl cheat sheet
es_es: perlcheat Referencia rápida de Perl

source: login( $username => $password );
es_es: login( $usuario => $contraseña );

source: Probably only the first of these is what you want:
es_es: Probablemente le valga con algunos de estos ejemplos:

source: These modifiers do not carry over into named subpatterns called in the enclosing group.
es_es: Estos modificadores no se transfieren a sub-patrones nominados en el grupo que los envuelve.

source: =item last LABEL X<last> X<break>
es_es: =item last ETIQUETA X<last> X<break>

source: C<$year> is the number of years since 1900, B<not> just the last two digits of the year.
es_es: C<$anno> es el número de años desde 1900, B<no> sólo los dos últimos dígitos del año.

source: In list context, if the left operand is enclosed in parentheses or is a list formed by C<qw/STRING/>, it repeats the list.
es_es: En contexto de lista, si el operando de la izquierda se encierra entre paréntesis o es una lista formada por C<qw/CADENA/>, repite la lista.

source: Previously it would erroneously turn off all warnings.
es_es: Anteriormente, desactivaría erróneamente todas las advertencias.

source: =head2 Quote and Quote-like Operators X<operator, quote> X<operator, quote-like> X<q> X<qq> X<qx> X<qw> X<m> X<qr> X<s> X<tr> X<'> X<''> X<"> X<""> X<//> X<`> X<``> X<<< << >>> X<escape sequence> X<escape>
es_es: =head2 Comillas y Operadores de comillas X<operator, quote> X<operator, quote-like> X<q> X<qq> X<qx> X<qw> X<m> X<qr> X<s> X<tr> X<'> X<''> X<"> X<""> X<//> X<`> X<``> X<<< << >>> X<escape sequence> X<escape> X<escapado> X<operador, comilla> X<operador, entrecomillado>

source: A new class of variables has been introduced.
es_es: Una nueva clase de variables ha sido introducida.

source: The following rules apply:
es_es: Se aplica las siguientes reglas:

source: Thus it breaks up characters into their UTF-8 bytes, so you may end up with malformed pieces of UTF-8.
es_es: Por lo tanto, rompe los caracteres UTF-8 en sus respectivos bytes, por lo que puede terminar con partes incorrectas de UTF-8.

source: sub backwards { $b cmp $a }
es_es: sub al_reves { $b cmp $a }

source: All other values are true.
es_es: Todos los demás valores son verdadero.

source: Likely candidates are: "op/stat", "lib/io_pipe", "lib/io_sock", "lib/io_udp" and "lib/time".
es_es: Los candidatos probables son: "op/stat", "lib/io_pipe", "lib/io_sock", "lib/io_udp" y "lib/time".

source: {n} Match exactly n times
es_es: {n} Coincide exactamente n veces

source: The array indices start with 0.
es_es: Los índices de array empiezan por 0.

source: See L<perldiag>.
es_es: Vea L<perldiag>.

source: C<state> is available only if the C<"state"> feature is enabled.
es_es: C<state> solo está disponible si está activa la característica C<"state">.

source: Changes the name of a file; an existing file NEWNAME will be clobbered.
es_es: Cambia el nombre de un archivo; un archivo existente que se llame NOMBRE_NUEVO será sobreescrito.

# printf "Permissions are %04o ", S_IMODE($mode), " ";
source: printf "Permissions are %04o\n", S_IMODE($mode), "\n";
es_es: printf "Permisos son %04o\n", S_IMODE($modo), "\n";

source: Array Regex array grep grep /$b/, @$a
es_es: Array Regex grep array grep /$b/, @$a

source: But you can use perl anyway.
es_es: Pero puede usar perl, de todos modos.

source: These are our best guesses at the moment: we reserve the right to rethink.
es_es: Estas son nuestras mejores estimaciones por el momento: nos reservamos el derecho de reconsiderarlo.

source: =head2 Where can I get information on Perl?
es_es: =head2 ¿Dónde puedo obtener información sobre Perl?

source: The STDIN filehandle used by the command is inherited from Perl's STDIN.
es_es: El identificador de archivo STDIN utilizado por el comando se hereda del STDIN de Perl.

source: If both OFFSET and LENGTH are omitted, removes everything.
es_es: Si ambos DESPLAZAMIENTO y LONGITUD se omiten, quita todo.

source: # short 12, zero fill to position 4, long 34
es_es: # un 12 short, relleno con ceros a la posición 4, un 34 long

source: Unlike in C, the scalar assignment operator produces a valid lvalue.
es_es: A diferencia de C, el operador de asignación escalar produce un I<ivalor> válido.

source: If FILENAME is omitted, uses C<$_>.
es_es: Si se omite NOMBRE_DIRECTORIO, utiliza C<$_>.

source: Some documentation typo fixes.
es_es: Algunas correcciones ortográficas en la documentación.

source: open(SPLAT, "stuff") || die "can't open stuff: $!";
es_es: open(SPLAT, "stuff") || die "no puedo abrir stuff: $!";

source: Quantifier Form Bracketing Form
es_es: Forma Cuantificador Forma con paréntesis

source: unpack("a3/A A*", "007 Bond J ") gives (" Bond", "J")
es_es: unpack("a3/A A*", "007 Bond J ") da (" Bond", "J")

source: Be honest about possible disadvantages to your choice of Perl since any choice has trade-offs.
es_es: Sea honesto y admita posibles desventajas de elegir Perl. Al fin y al cabo, toda elección conlleva ventajas y desventajas.

source: Although it has no direct equivalent in C, Perl's C<//> operator is related to its C-style or.
es_es: A pesar de que no tiene equivalente directo en C, el operador Perl C<//> está relacionado con el operador or del C.

source: Returns the sine of EXPR (expressed in radians).
es_es: Devuelve el seno de EXPR (expresado en radianes).

source: Sometimes a block is delimited by the file containing it (in the case of a required file, or the program as a whole), and sometimes a block is delimited by the extent of a string (in the case of an eval).
es_es: Algunas veces un bloque está delimitado por el archivo que lo contiene (en el caso de un archivo requerido, o el programa entero) y otras veces un bloque está delimitado por la extensión de una cadena (en el caso de un C<eval>).

source: See the C<use> function, of which C<no> is the opposite.
es_es: Ver la función C<use>, de la cuál C<no> es lo opuesta.

source: object-oriented programming
es_es: programación orientada a objetos

source: (This is considered a symbolic reference, so C<use strict "refs"> should I<not> be in effect.)
es_es: (Esto se considera una referencia simbólica, por lo que C<use strict "refs"> I<no> debe estar activado.)

source: You may make and give away verbatim copies of the source form of the Standard Version of this Package without restriction, provided that you duplicate all of the original copyright notices and associated disclaimers.
es_es: Usted puede hacer y regalar copias literales del contenido original de la Versión Estándar de este Paquete sin restricciones, siempre que se dupliquen todos los avisos de copyright y las renuncias asociadas.

source: Here's a mailbox appender for BSD systems.
es_es: Esto es un agregador de correo para sistemas BSD.

source: The subtests 9 and 18 of lib/Net/Ping/t/450_service.t, and the subtest 2 of lib/Net/Ping/t/510_ping_udp.t might fail if you have an unusual networking setup.
es_es: Los subtests 9 y 18 de lib/Net/Ping/t/450_service.t, y el subtest 2 de lib/Net/Ping/t/510_ping_udp.t pueden fallar si usted tiene una inusual configuración de red.

source: C<map> in void context is no longer expensive.
es_es: C<map> en contexto vacío ya no es oneroso.

source: A single-quoted, literal string.
es_es: Un entrecomillado simple, una cadena de caracteres literal.

source: perl593delta Perl changes in version 5.9.3
es_es: perl593delta Cambios en la versión 5.9.3

# print "$some_dir/$_ ";
source: print "$some_dir/$_\n";
es_es: print "$algun_dir/$_\n";

source: See C<i> under L</Modifiers> above.
es_es: Vea C<i> bajo L</Modificadores>, más arriba.

source: Since Perl has no way of checking whether the value passed to C<unpack()> corresponds to a valid memory location, passing a pointer value that's not known to be valid is likely to have disastrous consequences.
es_es: Dado que Perl no tiene manera de comprobar si el valor pasado a C<unpack()> corresponde a una ubicación de memoria válida, pasando un valor de puntero que no se sabe de su validez, puede tener consecuencias desastrosas.

source: =item Otherwise, if C<use locale> is in effect
es_es: =item De lo contrario, si C<use locale> está activo

source: Note that C<-s/a/b/> does not do a negated substitution.
es_es: Note que C<-s/a/b/> no realiza una substitución negada.

source: You may not even need to write the module.
es_es: Puede que ni siquiera tenga que escribir el módulo.

source: What is CPAN?
es_es: ¿Qué es CPAN?

source: If the $comment field is unsupported, it is an empty scalar.
es_es: Si el campo $comentario no está soportado, es un escalar vacío.

source: Binary "!~" is just like "=~" except the return value is negated in the logical sense.
es_es: Binario "!~" es justo como "=~" excepto que el valor de retorno es negado, en el sentido lógico.

source: =head2 suidperl less insecure
es_es: =head2 suidperl menos inseguro

# N [7] Any character but (experimental).
source: \N [7] Any character but \n (experimental).
es_es: \N [7] Cualquier carácter excepto \n (experimental)
